#include <hidef.h>      
#include "derivative.h" 

/**********************函数声明********************/
//需外部调用
extern void SCI_init(unsigned char uc_clk, unsigned int ui_bundrate);

/************************************************************************
    函数：SCI0_Init(void)
    功能：SCI0初始化
    入口参数：无
    出口参数：无
    说明：
************************************************************************/
void SCI_init(unsigned char uc_clk, unsigned int ui_bundrate)
{
    SCI0BD = uc_clk * 1000000 / 16 / ui_bundrate;    //设置波特率
    
    SCI0CR1 = 0X04;                /*  
                                    *  0b00000100
                                    *    ||||||||__ 仅在PE=1时有效
                                    *    |||||||___ 奇偶校验禁止
                                    *    ||||||____ 在停止后对空闲特征位计数
                                    *    |||||_____ 空闲线唤醒
                                    *    ||||______ 8位正常模式
                                    *    |||_______ 此位仅在LOOPS=1时有效
                                    *    ||________ SCI在等待模式下继续运行
                                    *    |_________ 正常工作，RxD和TxD使用独立引脚
                                    */
                                    
    SCI0CR2 = 0X2C;                /*  
                                    *  0b00101100
                                    *    ||||||||__ 正常发送器操作
                                    *    |||||||___ 正常SCI接收器操作
                                    *    ||||||____ 接收器使能
                                    *    |||||_____ 发送器使能
                                    *    ||||______ IDLE中断请求禁止
                                    *    |||_______ RDRF中断请求开启
                                    *    ||________ TC中断请求禁止
                                    *    |_________ 中断请求禁止
                                    */
} 