/***************************************************************************
    文件名称: AD.c

    项目名称: Test_V1.0 

    作者:     季齐

    版本:     V1.0
    
    说明:     完成PIT定时1秒的初始化

    修改记录: 无
***************************************************************************/
#include <hidef.h>           
#include "derivative.h"       
#include "AD.h"  
           
extern void AD_Init(void)
{
    ATD0DIEN = 0;           //禁止数字输入
    ATD0CTL1 = 0x40;        //AD分辨率选择12位,且采样前不放电
    ATD0CTL2 = 0x40;        //AD快速清零，禁止外部触发，禁止ATD转换序列完成中断，禁止ATD比较中断
    ATD0CTL3 = 0x90;        //AD转换结果右对齐，转换序列长度2位，非FIFO模式
    ATD0CTL4 = 0x03;        //采样时间4个周期，f(ATD)=f(BUF)/8
    ATD0CTL5 = 0x30;        //多通道连续采样，通道0，1                   
}

