/***************************************************************************
    文件名称: AD.c

    作者:     智能车项目摄像头组

    版本:     2016-11-07
    
    说明:     完成AD模块的初始化

    修改记录: 无
***************************************************************************/
#include <hidef.h>           
#include "derivative.h"       
#include "AD.h"  
           
extern void AD_Init(void)
{    
    ATD0DIEN = 0;           //禁止数字输入
    
    ATD0CTL1 = 0x40;        //AD分辨率选择12位,且采样前不放电
    
    ATD0CTL2 = 0x40;        //AD快速清零，禁止外部触发，禁止ATD转换序列完成中断，禁止ATD比较中断
    
    ATD0CTL3 = 0x90;        //AD转换结果右对齐，转换序列长度2位，非FIFO模式
    
    ATD0CTL4 = 0x00;        //采样时间4个周期，f(ATD)=f(BUF)/(2*(3+1))
    
    ATD0CTL5 = 0X30;        //连续多通道转换 通道AN0开始
                  
}